In [1]:
import numpy as np
import pandas as pd

### 删除多列
#### 在进行数据分析时，并非所有的列都有用，用df.drop可以方便地删除指定列

In [2]:
def drop_multiple_col(col_name_list, df):
    """
    删除多列
    :param col_name_list: 待删除列名
    :param df: 待操作DataFrame
    :return: 删除相应列后的DataFrame
    """
    df.drop(col_name_list, axis=1, inplace=True)
    return df

In [3]:
train = pd.read_csv('train.csv')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train = drop_multiple_col(['PassengerId'], train)
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 转换数据类型
#### 当数据集变大时，需要转换数据类型来节省内存

In [5]:
def change_dtypes(col_int, col_float, df):
    """
    转换数据类型以节省内存
    :param col_int: 转换为整型的列
    :param col_float: 转换为浮点型的列
    :param df: 待操作DataFrame
    :return: 转换数据类型后的DataFrame
    """
    if len(col_int) > 0:
        df[col_int] = df[col_int].astype(np.int)
    if len(col_float) > 0:
        df[col_float] = df[col_float].astype(np.float)

In [6]:
train['Age'].isnull().value_counts()

False    714
True     177
Name: Age, dtype: int64

In [7]:
# 将空值行删除
train['Age'] = train['Age'].fillna('999')
train['Age'].isnull().value_counts()

False    891
Name: Age, dtype: int64

In [8]:
del_list = train[train.Age=='999'].index.to_list()
train = train.drop(del_list)

In [9]:
change_dtypes(['Age'], [], train)
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

### 将分类变量转换为数值变量
#### 一些机器学习模型要求变量采用数值格式。这需要先将分类变量转换为数值变量。同时也可以保留分类变量，以便进行数据可视化

In [10]:
def convert_cat2num(num_encode, df):
    """
    将分类变量转换为数值变量
    :param num_encode: 待转换的分类变量字典
    :param df: 待操作DataFrame
    :return: 转换后的DataFrame
    """
    df.replace(num_encode, inplace=True)

In [11]:
num_encodes = {'Sex': {'male':1, 'female': 0}}
convert_cat2num(num_encodes, train)
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",1,22,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",0,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",1,35,0,0,373450,8.0500,NaN,S
6,0,1,"McCarthy, Mr. Timothy J",1,54,0,0,17463,51.8625,E46,S
7,0,3,"Palsson, Master. Gosta Leonard",1,2,3,1,349909,21.0750,NaN,S
8,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",0,27,0,2,347742,11.1333,NaN,S
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",0,14,1,0,237736,30.0708,NaN,C
10,1,3,"Sandstrom, Miss. Marguerite Rut",0,4,1,1,PP 9549,16.7000,G6,S
11,1,1,"Bonnell, Miss. Elizabeth",0,58,0,0,113783,26.5500,C103,S
12,0,3,"Saundercock, Mr. William Henry",1,20,0,0,A/5. 2151,8.0500,NaN,S
13,0,3,"Andersson, Mr. Anders Johan",1,39,1,5,347082,31.2750,NaN,S
14,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",0,14,0,0,350406,7.8542,NaN,S
15,1,2,"Hewlett, Mrs. (Mary D Kingcome)",0,55,0,0,248706,16.0000,NaN,S
16,0,3,"Rice, Master. Eugene",1,2,4,1,382652,29.1250,NaN,Q
18,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",0,31,1,0,345763,18.0000,NaN,S
20,0,2,"Fynney, Mr. Joseph J",1,35,0,0,239865,26.0000,NaN,S
21,1,2,"Beesley, Mr. Lawrence",1,34,0,0,248698,13.0000,D56,S
22,1,3,"McGowan, Miss. Anna ""Annie""",0,15,0,0,330923,8.0292,NaN,Q
23,1,1,"Sloper, Mr. William Thompson",1,28,0,0,113788,35.5000,A6,S
24,0,3,"Palsson, Miss. Torborg Danira",0,8,3,1,349909,21.0750,NaN,S
25,1,3,"Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...",0,38,1,5,347077,31.3875,NaN,S
27,0,1,"Fortune, Mr. Charles Alexander",1,19,3,2,19950,263.0000,C23 C25 C27,S
30,0,1,"Uruchurtu, Don. Manuel E",1,40,0,0,PC 17601,27.7208,NaN,C
33,0,2,"Wheadon, Mr. Edward H",1,66,0,0,C.A. 24579,10.5000,NaN,S
34,0,1,"Meyer, Mr. Edgar Joseph",1,28,1,0,PC 17604,82.1708,NaN,C
35,0,1,"Holverson, Mr. Alexander Oskar",1,42,1,0,113789,52.0000,NaN,S
37,0,3,"Cann, Mr. Ernest Charles",1,21,0,0,A./5. 2152,8.0500,NaN,S
38,0,3,"Vander Planke, Miss. Augusta Maria",0,18,2,0,345764,18.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
856,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",0,45,1,1,36928,164.8667,NaN,S
857,1,1,"Daly, Mr. Peter Denis",1,51,0,0,113055,26.5500,E17,S
858,1,3,"Baclini, Mrs. Solomon (Latifa Qurban)",0,24,0,3,2666,19.2583,NaN,C
860,0,3,"Hansen, Mr. Claus Peter",1,41,2,0,350026,14.1083,NaN,S
861,0,2,"Giles, Mr. Frederick Edward",1,21,1,0,28134,11.5000,NaN,S
862,1,1,"Swift, Mrs. Frederick Joel (Margaret Welles Ba...",0,48,0,0,17466,25.9292,D17,S
864,0,2,"Gill, Mr. John William",1,24,0,0,233866,13.0000,NaN,S
865,1,2,"Bystrom, Mrs. (Karolina)",0,42,0,0,236852,13.0000,NaN,S
866,1,2,"Duran y More, Miss. Asuncion",0,27,1,0,SC/PARIS 2149,13.8583,NaN,C
867,0,1,"Roebling, Mr. Washington Augustus II",1,31,0,0,PC 17590,50.4958,A24,S
869,1,3,"Johnson, Master. Harold Theodor",1,4,1,1,347742,11.1333,NaN,S
870,0,3,"Balkic, Mr. Cerin",1,26,0,0,349248,7.8958,NaN,S
871,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",0,47,1,1,11751,52.5542,D35,S
872,0,1,"Carlsson, Mr. Frans Olof",1,33,0,0,695,5.0000,B51 B53 B55,S
873,0,3,"Vander Cruyssen, Mr. Victor",1,47,0,0,345765,9.0000,NaN,S
874,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",0,28,1,0,P/PP 3381,24.0000,NaN,C
875,1,3,"Najib, Miss. Adele Kiamie ""Jane""",0,15,0,0,2667,7.2250,NaN,C
876,0,3,"Gustafsson, Mr. Alfred Ossian",1,20,0,0,7534,9.8458,NaN,S
877,0,3,"Petroff, Mr. Nedelio",1,19,0,0,349212,7.8958,NaN,S
879,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",0,56,0,1,11767,83.1583,C50,C
880,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",0,25,0,1,230433,26.0000,NaN,S
881,0,3,"Markun, Mr. Johann",1,33,0,0,349257,7.8958,NaN,S
882,0,3,"Dahlberg, Miss. Gerda Ulrika",0,22,0,0,7552,10.5167,NaN,S
883,0,2,"Banfield, Mr. Frederick James",1,28,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,0,3,"Sutehall, Mr. Henry Jr",1,25,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,0,3,"Rice, Mrs. William (Margaret Norton)",0,39,0,5,382652,29.1250,NaN,Q
886,0,2,"Montvila, Rev. Juozas",1,27,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",0,19,0,0,112053,30.0000,B42,S
889,1,1,"Behr, Mr. Karl Howell",1,26,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",1,32,0,0,370376,7.7500,NaN,Q

### 检查缺失数据
#### 了解哪些列缺失的数据更多，从而确定怎么进行下一步的数据清洗和分析操作

In [12]:
def check_missing_data(df):
    """
    检查缺失时间
    :param df: 待操作DataFrame 
    :return: 转换后的DataFrame
    """
    return df.isnull().sum().sort_values(ascending=False)

In [13]:
check_missing_data(train)

Cabin       529
Embarked      2
Fare          0
Ticket        0
Parch         0
SibSp         0
Age           0
Sex           0
Name          0
Pclass        0
Survived      0
dtype: int64

### 删除列中的字符串
#### 有时候会有新的字符或其他奇怪的符号出现在字符串列中，我们需要将它们替换

In [14]:
def remove_col_str(col_name, df):
    """
    删除列中的字符串
    :param col_name: 待操作列
    :param df: 待操作DataFrame
    :return: 转换后的DataFrame
    """
    df[col_name].replace('&#.*', '', regex=True, inplace=True)

In [20]:
df_test = pd.DataFrame({'col1':['ewe', 'xzq'], 
                        'col2':['ewe&#&#', 'qlh&#xzq']})
df_test

  col1      col2
0  ewe   ewe&#&#
1  xzq  qlh&#xzq

In [21]:
remove_col_str('col2', df_test)
df_test

  col1 col2
0  ewe  ewe
1  xzq  qlh

### 删除列中的空格
#### 有时候字符串会有一些空格，我们需要将它们删除

In [27]:
def remove_col_white_space(col_name, df):
    """
    删除列中的空格
    :param col_name: 待操作列
    :param df: 待操作DataFrame
    :return: 转换后的DataFrame
    """
    df[col_name] = df[col_name].str.strip()

In [28]:
df_test = pd.DataFrame({'col1':['  ew e', 'xzq'], 
                        'col2':['ewe', 'qlhxzq']})
df_test

     col1    col2
0    ew e     ewe
1     xzq  qlhxzq

In [29]:
remove_col_white_space('col1', df_test)
df_test

   col1    col2
0  ew e     ewe
1   xzq  qlhxzq

### 用字符串连接两列

In [5]:
def concat_col_str_condition(col_1, col_2, pil, df):
    """
    连接两列
    :param col_1: 待连接第一列
    :param col_2: 待连接第二列
    :param pil: 条件（以什么字符结尾）
    :param df: 待操作DataFrame
    :return: 转换后的DataFrame
    """
    mask = df[col_1].str.endswith(pil, na=False)
    col_new = df[mask][col_1] + df[mask][col_2]
    col_new.replace(pil, '', regex=True, inplace=True)
    df['col_new'] = col_new

In [6]:
df_test = pd.DataFrame({'col1':['ewe11', 'xzq'], 
                        'col2':['ewe', 'qlhxzq']})
df_test

    col1    col2
0  ewe11     ewe
1    xzq  qlhxzq

In [7]:
concat_col_str_condition('col1', 'col2', '11', df_test)
df_test

    col1    col2 col_new
0  ewe11     ewe  eweewe
1    xzq  qlhxzq     NaN

### 转换时间戳（从字符串到日期时间格式）
#### 在处理时间序列数据时，我们可能需要将字符串格式的日期时间转换为需要的指定格式的日期时间

In [31]:
def convert_str_datetime(col_name, df):
    """
    转换时间戳
    :param col_name: 待转换列
    :param df: 待操作DataFrame
    :return: 转换后的DataFrame
    """
    df[col_name] = pd.to_datetime(df[col_name], format='%m/%d/%Y %H:%M:%S')

In [32]:
df_test = pd.DataFrame({'col1':['ewe11', 'xzq'], 
                        'col2':['ewe', 'qlhxzq'], 
                        'col3':['02/10/2020 15:30:00', '02/10/2020 16:00:00']})
df_test

    col1    col2                 col3
0  ewe11     ewe  02/10/2020 15:30:00
1    xzq  qlhxzq  02/10/2020 16:00:00

In [33]:
convert_str_datetime('col3', df_test)
df_test

    col1    col2                col3
0  ewe11     ewe 2020-02-10 15:30:00
1    xzq  qlhxzq 2020-02-10 16:00:00